---
title: Noise
classe: Autodesk.Revit.DB.Visual.Noise
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# Noise

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String NoiseColor1 { get; }` | `Noise.NoiseColor1` | String |
| `String NoiseColor2 { get; }` | `Noise.NoiseColor2` | String |
| `String NoiseLevels { get; }` | `Noise.NoiseLevels` | String |
| `String NoisePhase { get; }` | `Noise.NoisePhase` | String |
| `String NoiseSize { get; }` | `Noise.NoiseSize` | String |
| `String NoiseThresholdHigh { get; }` | `Noise.NoiseThresholdHigh` | String |
| `String NoiseThresholdLow { get; }` | `Noise.NoiseThresholdLow` | String |
| `String NoiseType { get; }` | `Noise.NoiseType` | String |
| `String TextureAngle { get; }` | `Noise.TextureAngle` | String |
| `String TextureLinkTextureTransforms { get; }` | `Noise.TextureLinkTextureTransforms` | String |
| `String TextureRealWorldOffsetX { get; }` | `Noise.TextureRealWorldOffsetX` | String |
| `String TextureRealWorldOffsetY { get; }` | `Noise.TextureRealWorldOffsetY` | String |
| `String TextureRealWorldOffsetZ { get; }` | `Noise.TextureRealWorldOffsetZ` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```